# GetTopVisibleWS

## Description
Returns a handle to topmost visible worksheet.

```pascal
FUNCTION GetTopVisibleWS : HANDLE;
```

```python

def vs.GetTopVisibleWS():
    return HANDLE
```

## Returns
Returns a HANDLE to the worksheet whose window is at the top of the window stacking order.

## Version
Availability: from VectorWorks9.0
## Category
* Worksheets